tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "coursier/formulas"
tap "databricks/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "modularml/packages"
brew "act"
brew "gettext"
brew "openjdk@17"
brew "apache-spark", link: false
brew "automake"
brew "azure-cli"
brew "bash"
brew "bat"
brew "cloc"
brew "cmake"
brew "curl"
brew "doxygen"
brew "eza"
brew "fzf"
brew "gh"
brew "ghcup"
brew "git-delta"
brew "go"
brew "helm"
brew "hyperfine"
brew "jq"
brew "jsoncpp"
brew "kafka"
brew "kcat"
brew "kubernetes-cli"
brew "lazygit"
brew "libtool"
brew "liquibase"
brew "lua"
brew "luajit"
brew "luarocks"
brew "neofetch"
brew "nlohmann-json"
brew "node"
brew "openjdk@11"
brew "pkg-config"
brew "postgresql@14", restart_service: true
brew "ripgrep"
brew "unixodbc"
brew "sqliteodbc"
brew "swig"
brew "tcl-tk"
brew "tfenv"
brew "tree"
brew "tree-sitter"
brew "watch"
brew "wget"
brew "xsel"
brew "zsh-fast-syntax-highlighting"
brew "azure/kubelogin/kubelogin"
brew "coursier/formulas/coursier"
brew "databricks/tap/databricks"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools"
brew "microsoft/mssql-release/mssql-tools18", link: false
brew "modularml/packages/modular"
cask "adoptopenjdk8"
cask "font-code-new-roman-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "love"
