tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "coursier/formulas"
tap "databricks/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "modularml/packages"
tap "sst/tap"
# Run your GitHub Actions locally
brew "act"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Development kit for the Java programming language
brew "openjdk@17"
# Engine for large-scale data processing
brew "apache-spark", link: false
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Installer for the general purpose language Haskell
brew "ghcup"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Testing and Mocking Framework
brew "googletest"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# Command-line benchmarking tool
brew "hyperfine"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for interacting with JSON
brew "jsoncpp"
# Open-source distributed event streaming platform
brew "kafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit", link: false
# Library for database change tracking
brew "liquibase"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# CommonMark compliant Markdown formatter
brew "mdformat"
# Run a Kubernetes cluster locally
brew "minikube"
# Fast, highly customisable system info script
brew "neofetch"
# JSON for modern C++
brew "nlohmann-json"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@11"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Safe, concurrent, practical language
brew "rust", link: false
# Rust toolchain installer
brew "rustup"
# CLI search and replace | Space Age seD
brew "sad"
# Build tool for Scala projects
brew "sbt"
# Multi-media library with bindings for multiple languages
brew "sfml"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# ODBC driver for SQLite
brew "sqliteodbc"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Tool Command Language
brew "tcl-tk"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# JavaScript package manager
brew "yarn"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18", link: false
# Modular developer CLI tool
brew "modularml/packages/modular"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
cask "font-code-new-roman-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# GPU-based terminal emulator
cask "kitty"
# 2D game framework for Lua
cask "love"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Open-source code editor
cask "visual-studio-code"
vscode "auryn.nord-theme-auryn"
vscode "docker.docker"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
